# -*- coding: utf-8 -*-

print('Hello, My Lovely Friend! Welcome to Python World(-^.^-)!')
print('***********************************************************************')
print('***********************************小贴士*********************************')
print('***********************************************************************')
print('如果需要使用中文，务必在每个python文件前面加上 # -*- coding: utf-8 -*-')
print('python的习惯命名规则为单词_单词,比如base_type')
print('requirements.txt文件记载了当前工程运行所需要的类库'
      '每次从git上拉取代码后，ide下面有一个Terminal点开它，输入pip install -r requirements.txt回车来安装必要的库'
      '如果你需要安装其他的库，打开Terminal输入pip install [lib_name]回车来安装，比如pip install numpy就可以安装numpy库了，记得'
      '安装完之后打开Terminal输入pip freeze > requirements.txt更新当前工程需要的类库')
print('print函数用来打印文字，你看，我们这个小贴士是不是用了很多print啊')
print('想运行某个文件请在文件中使用右键，然后找到Run \'xxx\'单击在下方的Run面板就能看到啦，'
      '废话不多说了，请系好安全带，我们要发车了!!!!')
print('***********************************************************************')
print('***********************************************************************')

